""
# Synopsys Design Constraints Format
# Copyright © 2011, Synopsys, Inc. and others. All Rights reserved.
""
# clock definition
create_clock -name mclk -period 0.0 [get_ports clk_i]
""
#input delays
set_input_delay 0.0 [get_ports {inputnsocdbgreset_i}] -clock mclk
set_input_delay 0.0 [get_ports {aclkenm0_i}] -clock mclk
set_input_delay 0.0 [get_ports {atclken_i}] -clock mclk
set_input_delay 0.0 [get_ports {nscureset_i}] -clock mclk
set_input_delay 0.0 [get_ports {arreadym0_i}] -clock mclk
set_input_delay 0.0 [get_ports {rvalidm0_i}] -clock mclk
set_input_delay 0.0 [get_ports {rlastm0_i}] -clock mclk
set_input_delay 0.0 [get_ports {awreadym0_i}] -clock mclk
set_input_delay 0.0 [get_ports {wreadym0_i}] -clock mclk
set_input_delay 0.0 [get_ports {bvalidm0_i}] -clock mclk
set_input_delay 0.0 [get_ports {pclkendbg_i}] -clock mclk
set_input_delay 0.0 [get_ports {pseldbg_i}] -clock mclk
set_input_delay 0.0 [get_ports {penabledbg_i}] -clock mclk
set_input_delay 0.0 [get_ports {pwritedbg_i}] -clock mclk
set_input_delay 0.0 [get_ports {cisbypass_i}] -clock mclk
set_input_delay 0.0 [get_ports {tsmaxwidth_i}] -clock mclk
set_input_delay 0.0 [get_ports {tsnatural_i}] -clock mclk
set_input_delay 0.0 [get_ports {clkchange_i}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddrv_i}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddrv_i}] -clock mclk
set_input_delay 0.0 [get_ports {scuramclamp_i}] -clock mclk
set_input_delay 0.0 [get_ports {cfgsdisable_i}] -clock mclk
set_input_delay 0.0 [get_ports {filteren_i}] -clock mclk
set_input_delay 0.0 [get_ports {eventi_i}] -clock mclk
set_input_delay 0.0 [get_ports {l2associativity_i}] -clock mclk
set_input_delay 0.0 [get_ports {l2cfgend_i}] -clock mclk
set_input_delay 0.0 [get_ports {l2spniden_i}] -clock mclk
set_input_delay 0.0 [get_ports {l2stopclk_i}] -clock mclk
set_input_delay 0.0 [get_ports {l2filteren_i}] -clock mclk
set_input_delay 0.0 [get_ports {dftse_i}] -clock mclk
set_input_delay 0.0 [get_ports {dftrstdisable_i}] -clock mclk
set_input_delay 0.0 [get_ports {ncpureset_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ncpureset_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ncpureset_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ncpureset_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {ndbgreset_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ndbgreset_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ndbgreset_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ndbgreset_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[7]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[8]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[9]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[10]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[11]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[32]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[33]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[34]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[35]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[36]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[37]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[38]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[39]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[40]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[41]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[42]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[43]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[44]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[45]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[46]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[47]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[48]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[49]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[50]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[51]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[52]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[53]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[54]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[55]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[56]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[57]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[58]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[59]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[60]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[61]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[62]}] -clock mclk
set_input_delay 0.0 [get_ports {rdatam0_i[63]}] -clock mclk
set_input_delay 0.0 [get_ports {rrespm0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {rrespm0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {ridm0_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {brespm0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {brespm0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {bidm0_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[7]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[8]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[9]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[10]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[11]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[32]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[33]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[34]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[35]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[36]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[37]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[38]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[39]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[40]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[41]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[42]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[43]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[44]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[45]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[46]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[47]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[48]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[49]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[50]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[51]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[52]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[53]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[54]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[55]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[56]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[57]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[58]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[59]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[60]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[61]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[62]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[63]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[64]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[65]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[66]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[67]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[68]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[69]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[70]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[71]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[72]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[73]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[74]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[75]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[76]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[77]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[78]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[79]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[80]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[81]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[82]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[83]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[84]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[85]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[86]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[87]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[88]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[89]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[90]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[91]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[92]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[93]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[94]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[95]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[96]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[97]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[98]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[99]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[100]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[101]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[102]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[103]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[104]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[105]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[106]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[107]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[108]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[109]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[110]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[111]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[112]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[113]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[114]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[115]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[116]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[117]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[118]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[119]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[120]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[121]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[122]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[123]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[124]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[125]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[126]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[127]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[128]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[129]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[130]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[131]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[132]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[133]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[134]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[135]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[136]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[137]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[138]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[139]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[140]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[141]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[142]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[143]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[144]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[145]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[146]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[147]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[148]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[149]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[150]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[151]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[152]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[153]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[154]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[155]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[156]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[157]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[158]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[159]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[160]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[161]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[162]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[163]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[164]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[165]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[166]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[167]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[168]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[169]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[170]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[171]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[172]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[173]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[174]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[175]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[176]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[177]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[178]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[179]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[180]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[181]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[182]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[183]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[184]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[185]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[186]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[187]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[188]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[189]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[190]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[191]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[192]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[193]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[194]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[195]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[196]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[197]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[198]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[199]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[200]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[201]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[202]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[203]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[204]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[205]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[206]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[207]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[208]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[209]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[210]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[211]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[212]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[213]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[214]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[215]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[216]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[217]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[218]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[219]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[220]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[221]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[222]}] -clock mclk
set_input_delay 0.0 [get_ports {int_i[223]}] -clock mclk
set_input_delay 0.0 [get_ports {nirq_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {nirq_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {nirq_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {nirq_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {nfiq_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {nfiq_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {nfiq_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {nfiq_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {netmreset_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {netmreset_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {netmreset_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {netmreset_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[7]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[8]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[9]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[10]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[11]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {paddrdbg_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[7]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[8]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[9]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[10]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[11]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {pwdatadbg_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {cihsbypass_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {cihsbypass_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {cihsbypass_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {cihsbypass_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchin_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchin_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchin_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchin_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchoutack_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchoutack_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchoutack_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ctmchoutack_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {ctiexttrigack_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {ctiexttrigack_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {ctiexttrigack_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {ctiexttrigack_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {edbgrq_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {edbgrq_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {edbgrq_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {edbgrq_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgen_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgen_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgen_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgen_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {niden_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {niden_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {niden_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {niden_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {spiden_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {spiden_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {spiden_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {spiden_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {spniden_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {spniden_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {spniden_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {spniden_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {atready_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {atready_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {atready_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {atready_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {afvalid_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {afvalid_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {afvalid_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {afvalid_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[6]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[7]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[8]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[9]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[10]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[11]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[32]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[33]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[34]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[35]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[36]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[37]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[38]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[39]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[40]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[41]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[42]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[43]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[44]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[45]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[46]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[47]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[48]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[49]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[50]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[51]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[52]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[53]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[54]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[55]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[56]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[57]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[58]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[59]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[60]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[61]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[62]}] -clock mclk
set_input_delay 0.0 [get_ports {tsvalue_i[63]}] -clock mclk
set_input_delay 0.0 [get_ports {syncreq_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {syncreq_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {syncreq_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {syncreq_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {maxextin_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {maxextin_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {maxextin_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {maxextout_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {maxextout_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgrestart_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgrestart_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgrestart_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgrestart_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgswenable_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgswenable_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgswenable_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgswenable_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgromaddr_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {dbgselfaddr_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {cpuramclamp_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {cpuramclamp_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {cpuramclamp_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {cpuramclamp_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {periphclamp_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {periphclamp_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {periphclamp_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {periphclamp_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {cp15sdisable_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {cp15sdisable_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {cp15sdisable_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {cp15sdisable_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {cfgend_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {cfgend_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {cfgend_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {cfgend_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {vinithi_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {vinithi_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {vinithi_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {vinithi_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {teinit_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {teinit_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {teinit_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {teinit_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {l1rstdisable_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {l1rstdisable_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {l1rstdisable_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {l1rstdisable_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {clusterid_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {clusterid_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {clusterid_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {clusterid_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {filterstart_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {filterend_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {periphbase_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[3]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[4]}] -clock mclk
set_input_delay 0.0 [get_ports {l2cacheid_i[5]}] -clock mclk
set_input_delay 0.0 [get_ports {l2waysize_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {l2waysize_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {l2waysize_i[2]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[12]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[13]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[14]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[15]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[16]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[17]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[18]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[19]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {l2periphbase_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterstart_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[20]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[21]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[22]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[23]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[24]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[25]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[26]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[27]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[28]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[29]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[30]}] -clock mclk
set_input_delay 0.0 [get_ports {l2filterend_i[31]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli0_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli0_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli1_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli1_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli2_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli2_i[1]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli3_i[0]}] -clock mclk
set_input_delay 0.0 [get_ports {pwrctli3_i[1]}] -clock mclk
""
#output delays 
set_output_delay 0.0 [get_ports {arvalidm0_o}] -clock mclk
set_output_delay 0.0 [get_ports {rreadym0_o}] -clock mclk
set_output_delay 0.0 [get_ports {awvalidm0_o}] -clock mclk
set_output_delay 0.0 [get_ports {wvalidm0_o}] -clock mclk
set_output_delay 0.0 [get_ports {wlastm0_o}] -clock mclk
set_output_delay 0.0 [get_ports {breadym0_o}] -clock mclk
set_output_delay 0.0 [get_ports {preadydbg_o}] -clock mclk
set_output_delay 0.0 [get_ports {pslverrdbg_o}] -clock mclk
set_output_delay 0.0 [get_ports {scuidle_o}] -clock mclk
set_output_delay 0.0 [get_ports {evento_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2idle_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2clkstopped_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2co_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2drhit_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2drreq_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2dwhit_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2dwreq_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2dwtreq_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2irhit_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2irreq_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2wa_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2ipfalloc_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2epfrcvds0_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2epfrcvds1_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2epfhit_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2epfalloc_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2srrcvds0_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2srconfs0_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2srrcvds1_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2srconfs1_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2decerrintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2slverrintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2errrdintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2errrtintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2errwdintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2errwtintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2parrdintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2parrtintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2ecntrintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {l2ccintr_o}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {araddrm0_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {arlenm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arlenm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arlenm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {arlenm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {arsizem0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arsizem0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arsizem0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {arburstm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arburstm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arlockm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arlockm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arcachem0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arcachem0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arcachem0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {arcachem0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {arprotm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {arprotm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {arprotm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {aridm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {aruserm0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {awaddrm0_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {awlenm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awlenm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awlenm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awlenm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {awsizem0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awsizem0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awsizem0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awburstm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awburstm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awlockm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awlockm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awcachem0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awcachem0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awcachem0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awcachem0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {awprotm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awprotm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awprotm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {awidm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {awuserm0_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[32]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[33]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[34]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[35]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[36]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[37]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[38]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[39]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[40]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[41]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[42]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[43]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[44]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[45]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[46]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[47]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[48]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[49]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[50]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[51]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[52]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[53]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[54]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[55]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[56]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[57]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[58]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[59]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[60]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[61]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[62]}] -clock mclk
set_output_delay 0.0 [get_ports {wdatam0_o[63]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {wstrbm0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {widm0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {nirqout_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {nirqout_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {nirqout_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {nirqout_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {nfiqout_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {nfiqout_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {nfiqout_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {nfiqout_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {prdatadbg_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {pmuirq_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {pmuirq_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {pmuirq_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {pmuirq_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {commtx_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {commtx_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {commtx_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {commtx_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {commrx_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {commrx_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {commrx_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {commrx_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgrestarted_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgrestarted_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgrestarted_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgrestarted_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgnopwrdwn_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgnopwrdwn_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgnopwrdwn_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgnopwrdwn_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgtrigger_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgtrigger_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgtrigger_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgtrigger_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgack_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgack_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgack_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {dbgack_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {pwrctlo3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {wdresetreq_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {wdresetreq_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {wdresetreq_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {wdresetreq_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {smpnamp_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {smpnamp_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {smpnamp_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {smpnamp_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfi_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfi_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfi_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfi_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfe_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfe_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfe_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {standbywfe_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmen_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmen_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmen_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmen_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmpwrup_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmpwrup_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmpwrup_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmpwrup_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmstandbywfx_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmstandbywfx_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmstandbywfx_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmstandbywfx_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek1_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek2_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmfifopeek3_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmextout3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiexttrigout_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiexttrigout_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiexttrigout_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiexttrigout_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {nctirq_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {nctirq_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {nctirq_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {nctirq_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchout_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchout_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchout_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchout_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchinack_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchinack_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchinack_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctmchinack_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl1_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl2_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {ctiasicctl3_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {afready_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {afready_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {afready_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {afready_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atvalid_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atvalid_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atvalid_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atvalid_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata0_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata1_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata2_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[8]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[9]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[10]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[11]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[12]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[13]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[14]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[15]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[16]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[17]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[18]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[19]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[20]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[21]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[22]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[23]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[24]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[25]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[26]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[27]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[28]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[29]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[30]}] -clock mclk
set_output_delay 0.0 [get_ports {atdata3_o[31]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atbytes3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atid0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atid1_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atid2_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {atid3_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl0_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl1_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl2_o[7]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[0]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[1]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[2]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[3]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[4]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[5]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[6]}] -clock mclk
set_output_delay 0.0 [get_ports {etmasicctl3_o[7]}] -clock mclk
